Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K45A.tmx
Source language: en_us
Languages: zh_cn

source: THE WIND BLOWS
zh_cn: 风萧萧

source: SUDDENLY - dreadfully - she wakes up.
zh_cn: 她突然惊醒过来，心中惶恐不安。

source: What has happened?
zh_cn: 发生了什么事儿？

source: Something dreadful has happened.
zh_cn: 发生了可怕的事儿。

source: No - nothing has happened.
zh_cn: 不——什么事儿都没发生。

source: It is only the wind shaking the house, rattling the windows, banging a piece of iron on the roof and making her bed tremble.
zh_cn: 只不过是风声萧萧，屋动窗摇，铁片碰撞房顶的咣当声和床铺簌簌作响的颤抖声。

source: Leaves flutter past the window, up and away; down in the avenue a whole newspaper wags in the air like a lost kite and falls, spiked on a pine tree.
zh_cn: 树叶儿在窗外飘摇而过，高高地卷向远方；林荫道里，挂在松枝上的一张完整的报纸，像断线的风筝飘飞到半空，然后又晃晃悠悠地掉下来。

source: It is cold.
zh_cn: 天凉了。

source: Summer is over - it is autumn - everything is ugly.
zh_cn: 夏季已经结束——秋天到了——万物均变得丑陋不堪。

source: The carts rattle by, swinging from side to side; two Chinamen lollop along under their wooden yokes with the straining vegetable baskets - their pigtails and blue blouses fly out in the wind.
zh_cn: 双轮车左摇右晃，吱吱嘎嘎地驶过。两个中国佬用木扁担挑着菜筐顺着道路一颠一颠地前行，长辫和长衫在风中摇摆。

source: A white dog on three legs yelps past the gate.
zh_cn: 一条三只腿的白狗叫着从大门边走过。

source: It is all over!
zh_cn: 一切都结束了！

source: What is?
zh_cn: 什么？

source: Oh, everything!
zh_cn: 啊，一切!

source: And she begins to plait her hair with shaking fingers, not daring to look in the glass.
zh_cn: 她随即用颤抖的手指编起辫子来，眼睛却不敢对视镜子。

source: Mother is talking to grandmother in the hall.
zh_cn: 妈妈在客厅里同奶奶讲话。

source: A perfect idiot!
zh_cn: “十足的白痴！

source: Imagine leaving anything out on the line in weather like this. . . .
zh_cn: 想想在这种天气把什么都晾在绳子上......

source: Now my best little Teneriffe-work teacloth is simply in ribbons.
zh_cn: 我那张最精美的特纳里费小台布这下简直被刮成碎布片了。

source: What is that extraordinary smell?
zh_cn: 是什么怪味儿？

source: It's the porridge burning.
zh_cn: 粥熬糊了。

source: Oh, heavens - this wind!
zh_cn: 哎呀，天哪——这风哟！”

source: She has a music lesson at ten o'clock.
zh_cn: 她十点钟有一节音乐课。

source: At the thought the minor movement of the Beethoven begins to play in her head, the trills long and terrible like little rolling drums. . . .
zh_cn: 一想到这，贝多芬的小调乐章就开始在她脑海里演奏起来，悠长而又可怕的颤音，像是轻轻擂出的鼓点......

source: Marie Swainson runs into the garden next door to pick the "chrysanths" before they are ruined.
zh_cn: 玛丽·斯温森跑进隔壁的花园，去采即将被狂风摧折的“菊花”。

source: Her skirt flies up above her waist; she tries to beat it down, to tuck it between her legs while she stoops, but it is no use - up it flies.
zh_cn: 她的裙子往腰上翻飞，她试图按下去用腿夹住。但是不管用——它仍然往上翻。

source: All the trees and bushes beat about her.
zh_cn: 一株株树，一丛丛灌木在她的四周拍打着枝叶。

source: She picks as quickly as she can, but she is quite distracted.
zh_cn: 她倾其所能，快速采花，可是她却有些神不守舍。

source: She doesn't mind what she does - she pulls the plants up by the roots and bends and twists them, stamping her foot and swearing.
zh_cn: 她并不在意采花之事——把菊花连根拔起，一边折，一边拧，一边骂，一边跺脚。

source: For heaven's sake keep the front door shut!
zh_cn: “老天爷，把前门关上！

source: Go round to the back, shouts someone.
zh_cn: 绕后门走。”有人大声喊道。

source: And then she hears Bogey:
zh_cn: 接着，她听见博盖说：

source: Mother, you're wanted on the telephone.
zh_cn: “妈妈，你有电话。

source: Telephone, Mother.
zh_cn: 电话，妈妈。

source: It's the butcher.
zh_cn: 卖肉的打过来的。”

source: How hideous life is - revolting, simply revolting. . . .
zh_cn: 生活是多么的丑恶——令人厌恶，简直就是令人厌恶......

source: And now her hat-elastic's snapped.
zh_cn: 此时，她帽子的松紧带断了。

source: Of course it would.
zh_cn: 当然会断的。

source: She'll wear her old tam and slip out the back way.
zh_cn: 她将戴上旧的小园帽悄悄地从后门溜出去。

source: But Mother has seen.
zh_cn: 但是妈妈还是发现了。

source: Matilda. Matilda. Come back im-me-diately!
zh_cn: “玛蒂尔达，玛蒂尔达，马上回来！

source: What on earth have you got on your head?
zh_cn: 你头上究竟戴的是什么呀？

source: It looks like a tea cosy.
zh_cn: 像个茶壶套。

source: And why have you got that mane of hair on your forehead.
zh_cn: 你额头上为什么披着一团马鬃一样的头发。”

source: I can't come back, Mother.
zh_cn: “不行，妈妈。

source: I'll be late for my lesson.
zh_cn: 我上课要迟到了。”

source: Come back immediately!
zh_cn: “马上回来！”

source: She won't.
zh_cn: 她不会回去。

source: She hates Mother.
zh_cn: 她讨厌母亲。

source: "Go to hell," she shouts, running down the road.
zh_cn: “回来个鬼哟。”她大喊一声，跑到路上去了。

source: In waves, in clouds, in big round whirls the dust comes stinging, and with it little bits of straw and chaff and manure.
zh_cn: 像一排排的浪潮，像一团团的云彩，像一个个又大又圆的漩涡，尘土夹杂着细碎的秸秆、谷壳、肥料向她袭来。

source: There is a loud roaring sound from the trees in the gardens, and standing at the bottom of the road outside Mr. Bullen's gate she can hear the sea sob: "Ah! . . . Ah! . . . Ah-h!"
zh_cn: 风在花园里的树间怒吼，站在布伦先生大门外道路的尽头，她能听见大海的呜咽：“呜！呜！呜——！”

source: But Mr. Bullen's drawing-room is as quiet as a cave.
zh_cn: 但是布伦先生的客厅却像洞穴般似地平静。

source: The windows are closed, the blinds half-pulled, and she is not late.
zh_cn: 窗户关的严严的，窗帘半卷，她没有迟到。

source: The-girl-before-her has just started playing MacDowell's "To an Iceberg."
zh_cn: 前面的姑娘刚刚开始弹奏起麦克道威尔的《冰山曲》。

source: Mr. Bullen looks over at her and half smiles.
zh_cn: 布伦先生抬起头，似笑非笑地看过来。

source: Sit down, he says. "Sit over there in the sofa corner, little lady."
zh_cn: “请坐，”他说道，“在那边转角沙发上坐一坐吧，大小姐。”

source: How funny he is.
zh_cn: 他真奇怪。

source: He doesn't exactly laugh at you . . . but there is just something. . . .
zh_cn: 他不完全是在嘲笑......而是一种......

source: Oh, how peaceful it is here.
zh_cn: 啊，这里是多么宁静。

source: She likes this room.
zh_cn: 她喜欢这个房间。

source: It smells of art serge and stale smoke and chrysanthemums . . . there is a big vase of them on the mantelpiece behind the pale photograph of Rubinstein . . . a mon ami Robert Bullen. . . . .
zh_cn: 这儿有装饰布料、菊花的清香，也有炉烟的陈味......壁炉台上一大瓶菊花摆在褪色的鲁宾斯坦的照片后面......赠友人罗伯特·布伦（法语）......

source: Over the black glittering piano hangs "Solitude" - a dark tragic woman draped in white, sitting on a rock, her knees crossed, her chin on her hands.
zh_cn: 闪闪发亮的黑钢琴上方，悬挂着一幅《孤独》——双手托颔，双腿交叉，席地而坐的白衣黑肤怨妇。

source: No, no! says Mr. Bullen, and he leans over the other girl, puts his arms over her shoulders and plays the passage for her.
zh_cn: “不对，不对！”布伦先生说道，他倾过身去，在那姑娘的肩上展开双臂，替她弹奏了那一小段。

source: The stupid - she's blushing!
zh_cn: 傻瓜——她脸红了！

source: How ridiculous!
zh_cn: 真可笑！

source: Now the-girl-before-her has gone; the front door slams.
zh_cn: 前面的姑娘走了；前门砰然闭上。

source: Mr. Bullen comes back and walks up and down, very softly, waiting for her.
zh_cn: 布伦先生返身回来，非常轻柔地踱着步子，等待着她开始弹琴。

source: What an extraordinary thing. Her fingers tremble so that she can't undo the knot in the music satchel.
zh_cn: 十分奇怪，她的指头不停地颤抖，解不开曲谱袋上的活结。

source: It's the wind. . . .
zh_cn: 是风......

source: And her heart beats so hard she feels it must lift her blouse up and down.
zh_cn: 她的心狂跳不止，她感觉衣服一定也在随着胸膛起伏跳动。

source: Mr. Bullen does not say a word.
zh_cn: 布伦先生一言不发。

source: The shabby red piano seat is long enough for two people to sit side by side.
zh_cn: 破旧的红色琴凳够得着两人并排而坐。

source: Mr. Bullen sits down by her.
zh_cn: 布伦先生在她身旁坐下。

source: Shall I begin with scales? she asks, squeezing her hands together. "I had some arpeggios, too."
zh_cn: “我从音阶开始，好么？”她问道，双手紧紧地贴在一起，“我也弹过琶音了。”

source: But he does not answer.
zh_cn: 他却默不作声。

source: She doesn't believe he even hears . . . and then suddenly his fresh hand with the ring on it reaches over and opens Beethoven.
zh_cn: 她相信他根本没听见......可是他突然伸出刚带上戒指不久的手，翻开贝多芬的曲谱。

source: Let's have a little of the old master, he says.
zh_cn: “我们就弹一点儿这位古典大师的吧。”他说。

source: But why does he speak so kindly - so awfully kindly - and as though they had known each other for years and years and knew everything about each other.
zh_cn: 可是他讲话为什么那么亲切——那么格外地亲切——仿佛他们是多年的知心朋友。

source: He turns the page slowly.
zh_cn: 他慢慢地翻过曲谱。

source: She watches his hand - it is a very nice hand and always looks as though it had just been washed.
zh_cn: 她望着他的手——一只漂亮的手，总是刚刚洗过的样子。

source: Here we are, says Mr. Bullen.
zh_cn: “好了，到此为止。”布伦先生说。

source: Oh, that kind voice - Oh, that minor movement.
zh_cn: 啊，那亲切的声音——啊，那小调乐章。

source: Here come the little drums. . . .
zh_cn: 接着是轻轻的鼓点......

source: Shall I take the repeat?
zh_cn: “我再弹一遍好么？”

source: Yes, dear child.
zh_cn: “弹吧，亲爱的孩子。”

source: His voice is far, far too kind.
zh_cn: 他的声音格外格外地亲切。

source: The crotchets and quavers are dancing up and down the stave like little black boys on a fence.
zh_cn: 四分音符和八分音符在谱线上跳上跳下，像是一个个趴在栏杆上的小小的黑孩子。

source: Why is he so . . .
zh_cn: 他为什么那么......

source: She will not cry - she has nothing to cry about. . . .
zh_cn: 她不会哭——没什么可哭的......

source: What is it, dear child?"
zh_cn: “怎么了，亲爱的孩子？”

source: Mr. Bullen takes her hands.
zh_cn: 布伦先生拉着她的双手。

source: His shoulder is there - just by her head.
zh_cn: 他的肩——正好在她的头边。

source: She leans on it ever so little, her cheek against the springy tweed.
zh_cn: 她非常轻地靠在他的肩上，脸颊贴着富有弹性的花呢。

source: Life is so dreadful, she murmurs, but she does not feel it's dreadful at all.
zh_cn: “生活是多么可怕。”她喃喃自语道，却丝毫没有感觉到可怕。

source: He says something about "waiting" and "marking time" and "that rare thing, a woman," but she does not hear.
zh_cn: 他说着一些关于“等待”啦，“时间的标志”啦，“女人，稀罕事”啦之类的话，她却没有听进去。

source: It is so comfortable . . . for ever . . .
zh_cn: 多么舒服啊......永远......

source: Suddenly the door opens and in pops Marie Swainson, hours before her time.
zh_cn: 门突然开了，玛丽·斯温森蹦了进来，她提前了几个小时。

source: Take the allegretto a little faster, says Mr. Bullen, and gets up and begins to walk up and down again.
zh_cn: “小快板要弹得稍稍快些。”布伦先生说，他起身又在屋里踱起步来。

source: Sit in the sofa corner, little lady, he says to Marie.
zh_cn: “在转角沙发上坐一坐吧，大小姐。”他对玛丽说。

source: The wind, the wind.
zh_cn: 风啊，风啊。

source: It's frightening to be here in her room by herself.
zh_cn: 独自呆在房间里，她感到胆颤心惊。

source: The bed, the mirror, the white jug and basin gleam like the sky outside.
zh_cn: 床，镜子，白色的口缸和面盆，跟屋外的天空一样闪闪发光。

source: It's the bed that is frightening.
zh_cn: 吓人的是那张床。

source: There it lies, sound asleep.. . .
zh_cn: 它卧在那儿，沉沉昏睡......

source: Does Mother imagine for one moment that she is going to darn all those stockings knotted up on the quilt like a coil of snakes?
zh_cn: 妈妈想没想过，哪怕是一次，她要去织补被子上那些扎在一起的像蛇一样盘成一团的袜子？

source: She's not.
zh_cn: 她不会去。

source: No, Mother.
zh_cn: 不，妈妈。

source: I do not see why I should. . . .
zh_cn: 我不明白我为什么应该......

source: The wind - the wind!
zh_cn: 风啊——风啊！

source: There's a funny smell of soot blowing down the chimney.
zh_cn: 烟囱里倒灌进一股刺鼻的煤烟。

source: Hasn't anyone written poems to the wind? . . .
zh_cn: 有人对风写过诗吗？......

source: "I bring fresh flowers to the leaves and showers." . . .
zh_cn: “我给绿叶和阵雨带来鲜花。”......

source: What nonsense.
zh_cn: 无聊之极。

source: Is that you, Bogey?
zh_cn: “是你吗，博盖？”

source: Come for a walk round the esplanade, Matilda.
zh_cn: “到海滩去散散步吧，玛蒂尔达。

source: I can't stand this any longer.
zh_cn: 我受不了啦。

source: Right-o.
zh_cn: “好哩。

source: I'll put on my ulster.
zh_cn: 我穿上大衣就来。

source: Isn't it an awful day!
zh_cn: 天气糟透了！”

source: Bogey's ulster is just like hers.
zh_cn: 博盖的大衣跟她的一模一样。

source: Hooking the collar she looks at herself in the glass.
zh_cn: 她照了照镜子，扣上领扣。

source: Her face is white, they have the same excited eyes and hot lips.
zh_cn: 她的脸白皙，他俩都长着生气勃勃的眼睛，热力四射的嘴唇。

source: Ah, they know those two in the glass.
zh_cn: 啊，他们认识镜子里的那两个人。

source: Good-bye, dears; we shall be back soon.
zh_cn: 再见，亲爱的；我们不久就会回来。

source: This is better, isn't it?
zh_cn: “现在好些了，是不是？”

source: Hook on, says Bogey.
zh_cn: “挽着我。”博盖说。

source: They cannot walk fast enough.
zh_cn: 他们无法加快步伐。

source: Their heads bent, their legs just touching, they stride like one eager person through the town, down the asphalt zigzag where the fennel grows wild, and on to the esplanade.
zh_cn: 他们低着头，腿挨腿，像一个焦急的人在城中单独穿行，从四周长着野茴香的弯弯曲曲的柏油路走下去，来到海滩边。

source: It is dusky - just getting dusky.
zh_cn: 天色昏黄——正值黄昏之际。

source: The wind is so strong that they have to fight their way through it, rocking like two old drunkards.
zh_cn: 疾风劲吹，他们竭尽全力，挣扎着顶风而行，步履踉踉跄跄，宛如两个苍老的醉汉。

source: All the poor little pahutukawas on the esplanade are bent to the ground.
zh_cn: 海滩上那些可怜的小小的朴胡图卡瓦树全都被吹倒了。

source: Come on!
zh_cn: “过来点儿！

source: Let's get near.
zh_cn: 靠近些。”

source: Over by the breakwater the sea is very high.
zh_cn: 海水高高地漫过防浪堤。

source: They pull off their hats and her hair blows across her mouth, tasting of salt.
zh_cn: 他们拉下帽子，她的头发拂过嘴唇，一股咸咸的味道。

source: The sea is so high that the waves do not break at all; they thump against the rough stone wall and suck up the weedy, dripping steps.
zh_cn: 海水高涨，海浪毫无遮拦地撞击着顽石粗墙，吮吸着杂草丛丛、水珠串串的石梯。

source: A fine spray skims from the water right across the esplanade. They are covered with drops; the inside of her mouth tastes wet and cold.
zh_cn: 一团浪花飞过海滩，溅了他们一身水珠，她的嘴里感觉又湿又冷。

source: Bogey's voice is breaking. When he speaks he rushes up and down the scale. It's funny - it makes you laugh - and yet it just suits the day.
zh_cn: 博盖正在变声，说话音调时高时低，显得滑稽可笑——却正好配得上这种天气。

source: The wind carries their voices - away fly the sentences like narrow ribbons.
zh_cn: 风卷起他们的声音——把他们的话语像细丝带一样吹的远远的。

source: Quicker!
zh_cn: “快点儿！

source: It is getting very dark.
zh_cn: 天非常黑。

source: In the harbour the coal hulks show two lights - one high on a mast, and one from the stern.
zh_cn: 海港里的煤船都亮起了两盏灯——一盏在桅杆上，一盏在船尾。

source: Look, Bogey. Look over there.
zh_cn: “看那，博盖，看那边。”

source: A big black steamer with a long loop of smoke streaming, with the portholes lighted, with lights everywhere, is putting out to sea.
zh_cn: 一艘庞大的黑色汽船吐出一道长长的烟圈，舷窗齐亮，灯火通明，正在离港出海。

source: The wind does not stop her; she cuts through the waves, making for the open gate between the pointed rocks that leads to . . .
zh_cn: 它迎风劈浪，朝着尖锐的岩石间那道敞开的门户航行，那门户通往......

source: It's the light that makes her look so awfully beautiful and mysterious. . . .
zh_cn: 灯光使它显得非常美丽，非常神秘......

source: They are on board leaning over the rail arm in arm.
zh_cn: 他俩手挽着手倚在船舷的栏杆上。“......

source: ...Who are they?
zh_cn: 他们是谁？”

source: ...Brother and sister.
zh_cn: “......兄妹。”

source: Look, Bogey, there's the town.
zh_cn: “看那，博盖，那边是城区。

source: Doesn't it look small?
zh_cn: 显得小了点儿吧？

source: There's the post office clock chiming for the last time.
zh_cn: 邮局的钟声最后一次鸣响。

source: There's the esplanade where we walked that windy day.
zh_cn: 那儿是我们在那个大风天散步的海滩。

source: Do you remember?
zh_cn: 你还记得吗？

source: I cried at my music lesson that day - how many years ago !
zh_cn: 那天上音乐课我哭了——多少年过去了！

source: Good-bye, little island, good-bye. . . .
zh_cn: 再见，小岛，再见......”

source: Now the dark stretches a wing over the tumbling water.
zh_cn: 夜色伸出一只黑色的翅膀，遮挡住了滔滔的海浪。

source: They can't see those two any more.
zh_cn: 他们再也看不见那两个人了。

source: Good-bye, good-bye.
zh_cn: 再见，再见。

source: Don't forget. . . .
zh_cn: 不要忘记......

source: But the ship is gone, now.
zh_cn: 现在，船却已经远去

source: The wind-the wind.
zh_cn: 风啊——风啊。
